import React, {useState} from 'react';
import {
  SafeAreaView,
  View,
  Text,
  StyleSheet,
  TouchableOpacity,
  StatusBar,
  ScrollView,
} from 'react-native';
import CloseIcon from './../../assets/images/closeBlue.svg';
import PlusIcon from './../../assets/images/plusIcon.svg';
import MinusIcon from './../../assets/images/minus.svg';

interface FAQProps {
  route: any;
  navigation: any;
}

const FAQ = ({navigation}: FAQProps) => {
  const [faqContent, setFaqContent] = useState([
    {
      title: 'Какво е кутия-изненада на FoodObox?',
      open: false,
      content:
        'В твоята FoodObox-изненада ще намериш вкусно хапване, останало в излишък. Точното съдържание на кутията ще разбереш, когато отидеш да я вземеш на място. Описанието в мобилното приложение ще ти даде насоки какво можеш да очакваш, а филтрите ще те насочат допълнително. \nВлез в приложението, за да откриеш обектите близо до теб. Запази кутията си и я вземи на място в посочения прозорец за вземане. Плати на място в заведението. Усмихни се, защото си подарил втори живот на храната.',
    },
    {
      title:
        'Какво да направя ако съм алергичен към някой от продуктите в кутията?',
      open: false,
      content:
        'В твоята FoodObox-изненада ще намериш вкусно хапване, останало в излишък. Точното съдържание на кутията ще разбереш, когато отидеш да я вземеш на място. Описанието в мобилното приложение ще ти даде насоки какво можеш да очакваш, а филтрите ще те насочат допълнително. \nВлез в приложението, за да откриеш обектите близо до теб. Запази кутията си и я вземи на място в посочения прозорец за вземане. Плати на място в заведението. Усмихни се, защото си подарил втори живот на храната.',
    },
    {
      title: 'Защо не виждам обекти в моя район/град?',
      open: false,
      content:
        'В твоята FoodObox-изненада ще намериш вкусно хапване, останало в излишък. Точното съдържание на кутията ще разбереш, когато отидеш да я вземеш на място. Описанието в мобилното приложение ще ти даде насоки какво можеш да очакваш, а филтрите ще те насочат допълнително. \nВлез в приложението, за да откриеш обектите близо до теб. Запази кутията си и я вземи на място в посочения прозорец за вземане. Плати на място в заведението. Усмихни се, защото си подарил втори живот на храната.',
    },
    {
      title: 'Приложението има ли месечен/годишен абонамент?',
      open: false,
      content:
        'В твоята FoodObox-изненада ще намериш вкусно хапване, останало в излишък. Точното съдържание на кутията ще разбереш, когато отидеш да я вземеш на място. Описанието в мобилното приложение ще ти даде насоки какво можеш да очакваш, а филтрите ще те насочат допълнително. \nВлез в приложението, за да откриеш обектите близо до теб. Запази кутията си и я вземи на място в посочения прозорец за вземане. Плати на място в заведението. Усмихни се, защото си подарил втори живот на храната.',
    },
    {
      title: 'Как мога да спася “кутия-изненада”?',
      open: false,
      content:
        'В твоята FoodObox-изненада ще намериш вкусно хапване, останало в излишък. Точното съдържание на кутията ще разбереш, когато отидеш да я вземеш на място. Описанието в мобилното приложение ще ти даде насоки какво можеш да очакваш, а филтрите ще те насочат допълнително. \nВлез в приложението, за да откриеш обектите близо до теб. Запази кутията си и я вземи на място в посочения прозорец за вземане. Плати на място в заведението. Усмихни се, защото си подарил втори живот на храната.',
    },
    {
      title: 'Мога ли да платя с карта в приложението?',
      open: false,
      content:
        'В твоята FoodObox-изненада ще намериш вкусно хапване, останало в излишък. Точното съдържание на кутията ще разбереш, когато отидеш да я вземеш на място. Описанието в мобилното приложение ще ти даде насоки какво можеш да очакваш, а филтрите ще те насочат допълнително. \nВлез в приложението, за да откриеш обектите близо до теб. Запази кутията си и я вземи на място в посочения прозорец за вземане. Плати на място в заведението. Усмихни се, защото си подарил втори живот на храната.',
    },
    {
      title: 'Има ли доставка?',
      open: false,
      content:
        'В твоята FoodObox-изненада ще намериш вкусно хапване, останало в излишък. Точното съдържание на кутията ще разбереш, когато отидеш да я вземеш на място. Описанието в мобилното приложение ще ти даде насоки какво можеш да очакваш, а филтрите ще те насочат допълнително. \nВлез в приложението, за да откриеш обектите близо до теб. Запази кутията си и я вземи на място в посочения прозорец за вземане. Плати на място в заведението. Усмихни се, защото си подарил втори живот на храната.',
    },
    {
      title: 'Възможно ли е друг да вземе моята поръчка?',
      open: false,
      content:
        'В твоята FoodObox-изненада ще намериш вкусно хапване, останало в излишък. Точното съдържание на кутията ще разбереш, когато отидеш да я вземеш на място. Описанието в мобилното приложение ще ти даде насоки какво можеш да очакваш, а филтрите ще те насочат допълнително. \nВлез в приложението, за да откриеш обектите близо до теб. Запази кутията си и я вземи на място в посочения прозорец за вземане. Плати на място в заведението. Усмихни се, защото си подарил втори живот на храната.',
    },
    {
      title: 'Как мога да отменя поръчката си?',
      open: false,
      content:
        'В твоята FoodObox-изненада ще намериш вкусно хапване, останало в излишък. Точното съдържание на кутията ще разбереш, когато отидеш да я вземеш на място. Описанието в мобилното приложение ще ти даде насоки какво можеш да очакваш, а филтрите ще те насочат допълнително. \nВлез в приложението, за да откриеш обектите близо до теб. Запази кутията си и я вземи на място в посочения прозорец за вземане. Плати на място в заведението. Усмихни се, защото си подарил втори живот на храната.',
    },
  ]);
  return (
    <SafeAreaView style={styles.container}>
      <ScrollView
        contentContainerStyle={{paddingBottom: 30, paddingHorizontal: '5%'}}
        showsVerticalScrollIndicator={false}>
        <View style={styles.header}>
          <Text style={styles.headerHeading}>Често задавани въпроси</Text>
          <TouchableOpacity onPress={() => navigation.goBack()}>
            <CloseIcon />
          </TouchableOpacity>
        </View>
        <View style={{marginTop: 20}}>
          {faqContent.map((val, i) => {
            return (
              <View key={i} style={styles.accordian}>
                <TouchableOpacity
                  style={styles.accordianHeader}
                  activeOpacity={0.8}
                  onPress={() => {
                    faqContent[i].open = !faqContent[i].open;
                    setFaqContent([...faqContent]);
                  }}>
                  <Text style={styles.accordianTitle}>{val.title}</Text>
                  {val.open ? <MinusIcon /> : <PlusIcon />}
                </TouchableOpacity>
                {val.open ? (
                  <Text style={styles.termsTxt}>{val.content}</Text>
                ) : null}
              </View>
            );
          })}
        </View>
      </ScrollView>
      <StatusBar
        barStyle="dark-content"
        backgroundColor="#FFFFFF"
        translucent={false}
      />
    </SafeAreaView>
  );
};

const styles = StyleSheet.create({
  container: {
    flex: 1,
    backgroundColor: '#FFFFFF',
  },
  header: {
    flexDirection: 'row',
    alignItems: 'center',
    justifyContent: 'space-between',
    marginTop: 20,
  },
  headerHeading: {
    color: '#182550',
    fontSize: 20,
  },
  subHeading: {
    fontSize: 16,
    marginTop: 20,
    color: '#182550',
  },
  termsTxt: {
    marginTop: 15,
    color: '#182550',
  },
  accordianHeader: {
    flexDirection: 'row',
    alignItems: 'center',
    justifyContent: 'space-between',
    backgroundColor: '#F5F5F5',
    // marginTop: 10,
    paddingVertical: 15,
    paddingHorizontal: 10,
    borderRadius: 8,
  },
  accordian: {
    marginTop: 15,
  },
  accordianTitle: {
    flex: 1,
    fontWeight: '700',
    color: '#182550',
    fontSize: 14,
    marginRight: 5,
  },
});

export default FAQ;
